//선택배열 예제
/* 수신자 모두
a[0]번째 데이터 선택, a[j]번째와 비교(a[0]>a[j])이면 두 수를 바꾼다.
			원본 데이터:  5  4  3  2  1
i=0	j=1	a[0]=5 > a[1]=4	[  4  5  3  2  1  ]
i=0	j=2	a[0]=4 > a[2]=3	[  3  5  4  2  1  ]
i=0	j=3	a[0]=3 > a[3]=2	[  2  5  4  3  1  ]
i=0	j=4	a[0]=2 > a[4]=1	[  1  5  4  3  2  ]
============================================================
a[1]번째 데이터 선택, a[j]번째와 비교(a[1]>a[j])이면 두 수를 바꾼다.
			원본 데이터:  1  5  4  3  2
i=1	j=2	a[1]=5 > a[2]=4	[  1  4  5  3  2  ]
i=1	j=3	a[1]=4 > a[3]=3	[  1  3  5  4  2  ]
i=1	j=4	a[1]=3 > a[4]=2	[  1  2  5  4  3  ]
============================================================
a[2]번째 데이터 선택, a[j]번째와 비교(a[2]>a[j])이면 두 수를 바꾼다.
			원본 데이터:  1  2  5  4  3
i=2	j=3	a[2]=5 > a[3]=4	[  1  2  4  5  3  ]
i=2	j=4	a[2]=4 > a[4]=3	[  1  2  3  5  4  ]
============================================================
a[3]번째 데이터 선택, a[j]번째와 비교(a[3]>a[j])이면 두 수를 바꾼다.
			원본 데이터:  1  2  3  5  4
i=3	j=4	a[3]=5 > a[4]=4	[  1  2  3  4  5  ]
============================================================
*/

package ex06_1_array_main;

import java.util.Arrays;

public class Homework_240102_Sort {
	public static void main(String[] args) {

///////////////////////방법1/////////////////////////		
		
		int[] a = { 5, 4, 3, 2, 1 };
		int imsi = 0;

		for (int i = 0; i < 4; i++) {
			for (int j = 4; i < j; j--) {
				if (a[i] > a[j]) {
					imsi = a[i];
					a[i] = a[j];
					a[j] = imsi;
				}
			}
		}
		System.out.println(Arrays.toString(a));

		
///////////////////////방법2/////////////////////////		
		
		for (int i = 0; i < 4; i++) {
			for (int j = 4; j > 0 && 4 - j < j; j--) {
				if (a[i] > a[j]) {
					imsi = a[i];
					a[i] = a[j];
					a[j] = imsi;
				}
			}
		}
		System.out.println(Arrays.toString(a));
	}

}
